Repository: SAP/script-to-package-tool-for-macos
Catalog: source/Script2Pkg/mul.lproj/Main.xcstrings
Source language: en
Languages: de

# 0eo-oW-yBS.title
source: Overwrite existing package
de: Existierendes Paket überschreiben

# 2SB-bx-137.title
source: Cut
de: Ausschneiden

# 4Es-9G-ssG.title
source: To notarize packages the Command Line Tools for Xcode 13 or later are required but are not installed at the moment. Please click the button below to install the Command Line Tools for Xcode.
de: Um Pakete zu beglaubigen, werden die Kommandozeilentools für Xcode 13 oder höher benötigt, aber momentan sind diese nicht installiert. Bitte klicken Sie die unten stehende Taste um die Kommandozeilentools für Xcode zu installieren.

# 4sb-4s-VLi.title
source: Quit Script2Pkg
de: Script2Pkg beenden

# 5kV-Vb-QxS.title
source: About Script2Pkg
de: Über Script2Pkg

# 5QV-rW-NRE.title
source: Packaging
de: Paketierung

# 7oi-hB-FCs.title
source: Select All
de: Alles auswählen

# 8gQ-yR-rnr.title
source: Settings…
de: Einstellungen …

# 9oH-Kh-usa.title
source: Notarize packages
de: Pakete beglaubigen

# 20I-Op-has.title
source: Don't have an app-specific password yet? Please create one at https://appleid.apple.com.
de: Sie haben noch kein App-spezifisches Passwort? Bitte erstellen Sie eines unter https://appleid.apple.com.

# 95H-TL-oeU.title
source: General
de: Allgemein

# aBF-DQ-GOt.title
source: Paste
de: Einsetzen

# aOU-lv-dLl.title
source: Create distribution packages
de: Verteilungspakete erstellen

# AP9-nh-UKh.title
source: By default, all packages are stored in the same location as the selected scripts. This may be changed by using the menu below. If at some point the selected location should not exist anymore, the location will be automatically reset to default.
de: Standardmäßig werden alle Pakete an derselben Stelle wie die ausgewählen Skripte gespeichert. Sie können den Speicherort im unten stehenden Menü ändern. Sollte der ausgewählte Speicherort irgendwann nicht mehr existieren, wird automatisch wieder die Standardeinstellung verwendet.

# avY-6F-Cxu.title
source: Copy
de: Kopieren

# BfI-Zo-V14.title
source: Once you have entered valid credentials for notarization, they are securely stored in your keychain. You may use the button below to invalidate the stored credentials. This also temporarily disables notarization for packages. You may enable notarization again at any time but then you will be asked for your credentials again.
de: Wenn Sie gültige Zugangsdaten für die Beglaubigung eingegeben haben, werden diese sicher in Ihrem Schlüsselbund gespeichert. Sie können die unten stehende Taste verwenden, um die gespeicherten Zugangsdaten zu verwerfen. Dies deaktiviert temporär die Beglaubigung von Paketen. Sie können die Beglaubigung jederzeit wieder aktivieren, müssen dann jedoch die entsprechenden Zugangsdaten neu eingeben.

# bVo-9E-j7Y.title
source: Redo
de: Wiederholen

# BW1-qO-gRM.title
source: Credentials
de: Zugangsdaten

# CB1-Rt-tT5.title
source: Close Window
de: Fenster schließen

# CNa-Zs-Ekf.title
source: By default, installer packages created by this tool will not leave a package receipt when installed. If you need to create installer packages which leave package receipts, enable the option below.
de: Normalerweise hinterlassen Pakete, die mit diesem Programm erzeugt wurden, keine Paketquittung. Falls Sie Installationspakete erzeugen wollen, die eine Paketquittung hinterlassen, aktivieren Sie bitte die nachfolgende Option.

# dCN-oY-xhH.title
source: Waiting for package to be notarized…
de: Warte auf Beglaubigung des Paketes …

# dPa-0q-E7o.title
source: Default package version:
de: Standard-Paketversion:

# eb6-XJ-yRV.title
source: Recent Scripts
de: Benutzte Skripte

# eCT-4K-Gqw.title
source: Select Scripts…
de: Skripte auswählen …

# eHd-rj-1lq.title
source: Notarize Existing Package…
de: Bestehendes Paket beglaubigen …

# ESs-tM-mKO.ibShadowedDisplayPattern
source: To create a payload-free macOS installer package, please click the "Select scripts" button below and select one or more scripts. For each script you select, a package is created (%{value1}@) and the script is added as the postinstall script.
de: Um ein macOS Installationspaket zu erzeugen, welches lediglich ein Skript enthält, klicken Sie bitte auf die untenstehende Taste "Skripte auswählen" und wählen Sie ein oder mehrere Skripte aus. Für jedes ausgewählte Skript wird ein Paket erzeugt (%{value1}@) und das Skript wird dem Paket als Postinstall-Skript hinzugefügt.

# eYa-w5-LZe.title
source: Ignore source folders with missing scripts
de: Quellordner mit fehlenden Skripten ignorieren

# gEM-CH-zLf.title
source: Select scripts
de: Skripte auswählen

# GPs-hN-YRN.title
source: Delete script after successful package creation
de: Skript nach erfolgreicher Paketerstellung löschen

# hgq-fm-bhE.title
source: Sign Existing Package…
de: Bestehendes Paket signieren …

# Hpi-vw-YUs.title
source: Keep Activity window on top of all other windows
de: Aktivitätsfenster immer im Vordergrund halten

# hWO-Qq-hnm.title
source: Same as script
de: Gleicher Speicherort wie Skript

# hz9-B4-Xy5.title
source: Services
de: Dienste

# I8H-38-0f0.title
source: Sign packages
de: Pakete signieren

# IWz-Pr-69B.title
source: Verifying credentials…
de: Zugangsdaten überprüfen …

# J3T-ee-JAE.title
source: Continue
de: Fortfahren

# J24-Wu-DNa.title
source: A macOS installer package can have an optional version number. Although this is not relevant for payload-free packages in most cases, it is required in some environments. If you want to use a specific version number, you can specify it in the field below. Alternatively, the version number can be taken from the name of the script, which you can enable with the checkbox below.
de: Ein macOS Installationspaket kann eine optionale Versionsnummer enthalten. Obwohl diese bei Paketen, die nur Skripte enthalten, in den meisten Fällen nicht relevant ist, gibt es Umgebungen, in denen sie notwendig ist. Falls Sie eine bestimmte Versionsnummer verwenden wollen, können Sie diese im unten stehenden Textfeld angeben. Alternativ kann die Versionsnummer auch aus dem Skriptnamen ausgelesen werden, wenn Sie die entsprechende Option aktivieren.

# JkW-Kq-xvY.title
source: Rename new package
de: Neues Paket umbenennen

# JZc-0g-R8A.title
source: Script2Pkg Help
de: Script2Pkg Hilfe

# Kd2-mp-pUS.title
source: Show All
de: Alle einblenden

# kOo-vx-Wtz.title
source: If package exists:
de: Falls Paket bereits existiert:

# kt6-28-Uuf.title
source: App-specific password:
de: App-spezifisches Passwort:

# kV4-Q6-gW4.title
source: Install Command Line Tools for Xcode
de: Kommandozeilentools für Xcode installieren

# LE2-aR-0XJ.title
source: Bring All to Front
de: Alle nach vorne bringen

# LIg-su-ajH.title
source: Create package receipts
de: Paketquittungen erzeugen

# lmE-yP-kZR.title
source: Delete
de: Löschen

# lVE-Qs-sJj.title
source: Invalidate credentials
de: Zugangsdaten verwerfen

# LWF-mz-iHy.title
source: Undo
de: Widerrufen

# MDa-b6-R1U.title
source: Settings
de: Einstellungen

# mDR-zy-rKU.title
source: Validate Package Signature…
de: Paketsignatur überprüfen …

# Mgh-3x-RlB.title
source: Your Apple ID or password is incorrect!
de: Ungültige Apple ID oder Passwort!

# mqD-k9-T2g.title
source: Distribution packages are a special format of installer packages, needed in some environments. If you need to create distribution packages instead of component packages, enable the option below.
de: Verteilungspakete sind spezielle Versionen von Installationspaketen, die in einigen Umgebungen benötigt werden. Wenn Sie Verteilungspakete anstelle von regulären Intallationspaketen erstellen wollen, aktivieren Sie bitte die untenstehende Option.

# NL1-cR-7nK.title
source: Use prefix as fixed package identifier
de: Präfix als feste Paketkennung benutzen

# NMo-om-nkz.title
source: Services
de: Dienste

# NRt-HZ-e3v.title
source: Locations
de: Speicherorte

# Olw-nP-bQN.title
source: Hide Script2Pkg
de: Script2Pkg ausblenden

# OY7-WF-poV.title
source: Minimize
de: Im Dock ablegen

# OYv-RX-u6B.title
source: Edit
de: Bearbeiten

source: pja-8S-hA5.ibShadowedIsNilPlaceholder
de: beispiel@icloud.com

source: pja-8S-hA5.ibShadowedNoSelectionPlaceholder
de: beispiel@icloud.com

# pnK-UQ-W5v.title
source: Activity
de: Aktivität

# QG6-jQ-Stm.title
source: Package location:
de: Speicherort für Pakete:

# R4o-n2-Eq4.title
source: Zoom
de: Zoomen

# r9m-eh-Azc.title
source: Cancel
de: Abbrechen

# RAm-yw-jux.title
source: Cancel
de: Abbrechen

# RRi-tu-J3v.placeholderString
source: example@icloud.com
de: beispiel@icloud.com

# Sao-9g-hia.title
source: Other…
de: Auswählen …

# tAJ-KT-xaE.title
source: File
de: Datei

# Td7-aD-5lo.title
source: Window
de: Fenster

# tu8-vn-5eW.title
source: If you want your packages to be signed, please make sure you have at least one valid "Developer ID Installer" identity in your login keychain. For notarization, the Command Line Tools for Xcode 13 or later must be installed.
de: Wenn Sie Ihre Pakete signieren möchten, stellen Sie bitte sicher, dass sich mindestens eine gültige "Developer ID Installer" Identität in Ihrem Anmeldeschlüsselbund befindet. Für die Beglaubigung von Paketen müssen die Kommandozeilentools für Xcode 13 oder höher installiert sein.

# TXr-0J-wqR.title
source: File
de: Datei

# tXw-Ta-TSf.title
source: A package can be based either on a single script or on a folder that must contain at least one script with either the name preinstall or postinstall. If a folder-based package contains none of these scripts, it will not do anything. If you would like to build those packages anyway, please uncheck the checkbox below.
de: Ein Paket kann entweder auf einem einzelnen Skript basieren oder aber auf einem Ordner, welcher mindestens ein Skript mit dem Namen preinstall oder postinstall enthalten muss. Falls ein ordnerbasiertes Paket keines dieser Skripte enthält, ist es ohne jede Funktion. Sollten Sie solche Pakete trotzdem erstellen wollen, deaktivieren Sie bitte die untenstehende Option.

# TYt-Xs-CuU.title
source: Use package version from script name if possible
de: Paketversion, wenn möglich, aus Skriptnamen auslesen

# U6Q-LW-EUa.title
source: Script2Pkg on GitHub
de: Script2Pkg auf GitHub

# uDt-w0-Dlo.title
source: Clear
de: Löschen

# Vdr-fp-XzO.title
source: Hide Others
de: Andere ausblenden

# vmC-HC-cmS.title
source: Cancel
de: Abbrechen

# vN6-x0-bEU.title
source: Keep successfully completed activities in list
de: Erfolgreich abgeschlossene Aktivitäten in Liste belassen

# voH-7I-8wr.title
source: Show notification when packaging has been finished
de: Mitteilung nach abgeschlossener Paketerstellung anzeigen

# vy2-Bx-Tyk.title
source: Package identifier prefix:
de: Präfix für Paketkennung:

# wz8-EM-PL4.title
source: Help
de: Hilfe

# Xni-Xz-Rjc.title
source: All macOS installer packages need an identifier so the macOS Installer can recognize a package as being an upgrade to an already-installed package. Even if this is not relevant to payload-free packages, an identifier must be set. If you need to change the default identifier prefix, please enter a new prefix in the text field below.
de: Alle macOS Installationspakete benötigen eine Paketkennung, damit das macOS Installationsprogramm feststellen kann, ob ein Paket ein Update eines bereits installierten Paketes ist. Auch wenn dies bei Paketen, die nur ein Skript enthalten, nicht relevant ist, so muss die Paketkennung dennoch angegeben werden. Falls Sie das Präfix für die Paketkennung ändern wollen, können Sie dies im unten stehenden Textfeld tun.

# xXo-qs-fbs.title
source: Help
de: Hilfe

# YBd-eW-q3p.title
source: Development team:
de: Entwicklerteam:

# yHs-dk-jby.title
source: Activity
de: Aktivität

# Z98-0m-f8Y.title
source: Running package build tasks…
de: Pakete werden erstellt …

# ZxJ-bt-Vh9.title
source: Edit
de: Bearbeiten
